Ran Plan for dir: `terragrunt/kubernetes/longhorn` workspace: `terragrunt_kubernetes_longhorn`

<details><summary>Show Output</summary>

```diff
Authenticated

01:01:01.954 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/NFPAgtL6WNWAODeglJb5NNPu8VQ/pvfWVn-ytiYF5gbqPLvVFuxkQbg
01:01:01.992 INFO   tofu: Initializing the backend...
01:01:02.264 INFO   tofu: Initializing provider plugins...
01:01:02.264 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:01:02.472 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:01:02.555 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:01:02.664 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:01:02.787 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:01:02.892 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:01:02.996 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:01:03.108 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:01:03.238 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:01:03.273 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:01:03.293 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
01:01:03.328 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:01:03.342 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:01:03.414 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:01:03.434 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:01:03.444 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:01:03.444 INFO   tofu: OpenTofu has been successfully initialized!
01:01:04.262 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:01:04.262 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:01:04.262 STDOUT tofu:   ~ update in-place
01:01:04.262 STDOUT tofu: OpenTofu will perform the following actions:
01:01:04.262 STDOUT tofu:   # helm_release.longhorn will be updated in-place
01:01:04.262 STDOUT tofu:   ~ resource "helm_release" "longhorn" {
01:01:04.262 STDOUT tofu:       ~ id                         = "longhorn" -> (known after apply)
01:01:04.262 STDOUT tofu:       ~ metadata                   = {
01:01:04.262 STDOUT tofu:           ~ app_version    = "v1.9.1" -> (known after apply)
01:01:04.262 STDOUT tofu:           ~ chart          = "longhorn" -> (known after apply)
01:01:04.263 STDOUT tofu:           ~ first_deployed = 1758162967 -> (known after apply)
01:01:04.263 STDOUT tofu:           ~ last_deployed  = 1758162967 -> (known after apply)
01:01:04.263 STDOUT tofu:           ~ name           = "longhorn" -> (known after apply)
01:01:04.263 STDOUT tofu:           ~ namespace      = "longhorn-system" -> (known after apply)
01:01:04.263 STDOUT tofu:           ~ revision       = 1 -> (known after apply)
01:01:04.263 STDOUT tofu:           ~ values         = jsonencode(
01:01:04.263 STDOUT tofu:                 {
01:01:04.263 STDOUT tofu:                   - defaultBackupStore = {
01:01:04.263 STDOUT tofu:                       - backupTarget                 = "s3://longhorn@us-east-1/"
01:01:04.263 STDOUT tofu:                       - backupTargetCredentialSecret = "longhorn-secrets"
01:01:04.263 STDOUT tofu:                     }
01:01:04.263 STDOUT tofu:                   - longhornUI         = {
01:01:04.263 STDOUT tofu:                       - replicas = 1
01:01:04.263 STDOUT tofu:                     }
01:01:04.263 STDOUT tofu:                 }
01:01:04.263 STDOUT tofu:             ) -> (known after apply)
01:01:04.263 STDOUT tofu:           ~ version        = "1.9.1" -> (known after apply)
01:01:04.263 STDOUT tofu:         } -> (known after apply)
01:01:04.263 STDOUT tofu:         name                       = "longhorn"
01:01:04.263 STDOUT tofu:       ~ values                     = [
01:01:04.263 STDOUT tofu:           - <<-EOT
01:01:04.263 STDOUT tofu:                 "defaultBackupStore":
01:01:04.263 STDOUT tofu:                   "backupTarget": "s3://longhorn@us-east-1/"
01:01:04.263 STDOUT tofu:                   "backupTargetCredentialSecret": "longhorn-secrets"
01:01:04.263 STDOUT tofu:                 "longhornUI":
01:01:04.263 STDOUT tofu:                   "replicas": 1
01:01:04.263 STDOUT tofu:             EOT,
01:01:04.263 STDOUT tofu:           + <<-EOT
01:01:04.263 STDOUT tofu:                 "defaultBackupStore":
01:01:04.263 STDOUT tofu:                   "backupTarget": "s3://longhorn@us-east-1/"
01:01:04.263 STDOUT tofu:                   "backupTargetCredentialSecret": "longhorn-secrets"
01:01:04.263 STDOUT tofu:                 "defaultSettings":
01:01:04.263 STDOUT tofu:                   "systemManagedComponentsNodeSelector": "!node-role.kubernetes.io/master"
01:01:04.264 STDOUT tofu:                 "longhornUI":
01:01:04.264 STDOUT tofu:                   "replicas": 1
01:01:04.264 STDOUT tofu:                 "persistence":
01:01:04.264 STDOUT tofu:                   "defaultClassReplicaCount": 2
01:01:04.264 STDOUT tofu:             EOT,
01:01:04.264 STDOUT tofu:         ]
01:01:04.264 STDOUT tofu:       ~ version                    = "1.9.1" -> "1.9.2"
01:01:04.264 STDOUT tofu:         # (25 unchanged attributes hidden)
01:01:04.264 STDOUT tofu:     }
01:01:04.264 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:01:04.264 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/longhorn -w terragrunt_kubernetes_longhorn
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Flonghorn%252Fterragrunt_kubernetes_longhorn)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/longhorn -w terragrunt_kubernetes_longhorn
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```